Файлы_конфигурации/Documents/РезервированиеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РезервированиеТовара</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Покупатели</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервированиеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносРезерва</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтмены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтменаРезервированияТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПереноса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереносРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходноКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Файлы_конфигурации/Documents/РезервированиеТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
		
	 ТекСтрока                   = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.ЕдиницыИзмерения  = 0;
	 ТекСтрока.Количество        = 0;	 
	 ТекСтрока.Цена              = 0;
	 ТекСтрока.Сумма             = 0;
	 Объект.СуммаДокумента       = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНаборСвойствПриИзменении(Элемент)

     ТекСтрока                   = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.ЕдиницыИзмерения  = 0;
	 ТекСтрока.Количество        = 0;	 
	 ТекСтрока.Цена              = 0;
	 ТекСтрока.Сумма             = 0;
	 Объект.СуммаДокумента       = Объект.Таблица.Итог("Сумма");	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки)
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаДокумента,
	|			Номенклатура = &НоменклатураИзСтроки
	|				И Организация = &ОрганизацияИзСтроки
	|				И ЕдиницаИзмерения = &ЕдиницаИзмеренияИзСтроки
	|				И ВариантНоменклатуры = &ВариантНоменклатурыИзСтроки
	|				И ВидЦены = &ВидЦеныИзСтроки) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаДокумента"              , СтруктураСтроки.Дата);
	Запрос.УстановитьПараметр("НоменклатураИзСтроки"       , СтруктураСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ОрганизацияИзСтроки"        , СтруктураСтроки.Организация);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияИзСтроки"   , СтруктураСтроки.ЕдиницыИзмерения);
	Запрос.УстановитьПараметр("ВариантНоменклатурыИзСтроки", СтруктураСтроки.НаборСвойств);
	Запрос.УстановитьПараметр("ВидЦеныИзСтроки"            , СтруктураСтроки.ВидЦен);
								
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		 ЦенаНоменклатуры = 0;
	Иначе
		 РезультатЗапроса = РезультатЗапроса.Выгрузить();
		 ЦенаНоменклатуры = РезультатЗапроса[0].Цена;
	КонецЕсли;
	
	СтруктураССервера = Новый Структура(); 
	СтруктураССервера.Вставить("ЦенаНоменклатуры",ЦенаНоменклатуры);
	СтруктураССервера.Вставить("КоэффициентЕдиницыИзмерения",СтруктураСтроки.ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения);

	Возврат СтруктураССервера;	
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдиницыИзмеренияПриИзменении(Элемент)
	
	ТекСтрока       = Элементы.Таблица.ТекущиеДанные;
	
	Если ПустаяСтрока(ТекСтрока.НаборСвойств) Тогда
		 Сообщить("Не заполнена колонка <<Набор свойств>> в строке № " + ТекСтрока.НомерСтроки + " таблицы");
		 Возврат;
	КонецЕсли;
	
	
	СтруктураСтроки = Новый Структура();
	СтруктураСтроки.Вставить("Номенклатура"    ,ТекСтрока.Номенклатура);
	СтруктураСтроки.Вставить("НаборСвойств"    ,ТекСтрока.НаборСвойств);
	СтруктураСтроки.Вставить("ЕдиницыИзмерения",ТекСтрока.ЕдиницыИзмерения);
	СтруктураСтроки.Вставить("Дата"            ,Объект.Дата);
	СтруктураСтроки.Вставить("Организация"     ,Объект.Организация);
	СтруктураСтроки.Вставить("ВидЦен"          ,Объект.ВидЦен);
 	
	СтруктураССервера = ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки);
	
	
	ТекСтрока.Цена   = СтруктураССервера.ЦенаНоменклатуры;
	
	Если СтруктураССервера.ЦенаНоменклатуры = 0 Тогда
		 Сообщить("В регистре отсутствует цена на номенклатуру <<"+ТекСтрока.Номенклатура+">> со свойствами <<"+ТекСтрока.НаборСвойств+">>, ед.изм. <<"+ ТекСтрока.ЕдиницыИзмерения+">>");
	КонецЕсли;
	
	ТекСтрока.КоэффициентЕдиницыИзмерения = СтруктураССервера.КоэффициентЕдиницыИзмерения;
	ТекСтрока.Количество                  = 0;	 
	ТекСтрока.Сумма                       = 0;
	Объект.СуммаДокумента                 = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоговорПриИзмененииНаСервере(Договор)
	
	Возврат Договор.ВидЦены;
	
КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Объект.ВидЦен = ДоговорПриИзмененииНаСервере(Объект.Договор);

КонецПроцедуры
